cases/nucleateBoiling_BuresSato/singlePhase/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (0 0 0);


boundaryField
{
    fluid_to_heater
    {
        type            noSlip;
    }

    side
    {
        //type            zeroGradient;
	type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        //type            zeroGradient;
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type             empty;
    }
    
}

// ************************************************************************* //
